docs/benchmarks/20260501_174117_compare_c500/run_b_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * booking_stress: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 46777 complete and 0 interrupted iterations
booking_stress   [   2% ] 500 VUs  0m01.0s/1m0s

running (0m02.0s), 500/500 VUs, 98842 complete and 0 interrupted iterations
booking_stress   [   3% ] 500 VUs  0m02.0s/1m0s

running (0m03.0s), 500/500 VUs, 151457 complete and 0 interrupted iterations
booking_stress   [   5% ] 500 VUs  0m03.0s/1m0s

running (0m04.0s), 500/500 VUs, 204411 complete and 0 interrupted iterations
booking_stress   [   7% ] 500 VUs  0m04.0s/1m0s

running (0m05.0s), 500/500 VUs, 257061 complete and 0 interrupted iterations
booking_stress   [   8% ] 500 VUs  0m05.0s/1m0s

running (0m06.0s), 500/500 VUs, 311184 complete and 0 interrupted iterations
booking_stress   [  10% ] 500 VUs  0m06.0s/1m0s

running (0m07.0s), 500/500 VUs, 364119 complete and 0 interrupted iterations
booking_stress   [  12% ] 500 VUs  0m07.0s/1m0s

running (0m08.0s), 500/500 VUs, 416623 complete and 0 interrupted iterations
booking_stress   [  13% ] 500 VUs  0m08.0s/1m0s

running (0m09.0s), 500/500 VUs, 470108 complete and 0 interrupted iterations
booking_stress   [  15% ] 500 VUs  0m09.0s/1m0s

running (0m10.0s), 500/500 VUs, 520666 complete and 0 interrupted iterations
booking_stress   [  17% ] 500 VUs  0m10.0s/1m0s

running (0m11.0s), 500/500 VUs, 568422 complete and 0 interrupted iterations
booking_stress   [  18% ] 500 VUs  0m11.0s/1m0s

running (0m12.0s), 500/500 VUs, 617031 complete and 0 interrupted iterations
booking_stress   [  20% ] 500 VUs  0m12.0s/1m0s

running (0m13.0s), 500/500 VUs, 661909 complete and 0 interrupted iterations
booking_stress   [  22% ] 500 VUs  0m13.0s/1m0s

running (0m14.0s), 500/500 VUs, 708249 complete and 0 interrupted iterations
booking_stress   [  23% ] 500 VUs  0m14.0s/1m0s

running (0m15.0s), 500/500 VUs, 756105 complete and 0 interrupted iterations
booking_stress   [  25% ] 500 VUs  0m15.0s/1m0s

running (0m16.0s), 500/500 VUs, 797053 complete and 0 interrupted iterations
booking_stress   [  27% ] 500 VUs  0m16.0s/1m0s

running (0m17.0s), 500/500 VUs, 843052 complete and 0 interrupted iterations
booking_stress   [  28% ] 500 VUs  0m17.0s/1m0s

running (0m18.0s), 500/500 VUs, 889102 complete and 0 interrupted iterations
booking_stress   [  30% ] 500 VUs  0m18.0s/1m0s

running (0m19.0s), 500/500 VUs, 936496 complete and 0 interrupted iterations
booking_stress   [  32% ] 500 VUs  0m19.0s/1m0s

running (0m20.0s), 500/500 VUs, 984895 complete and 0 interrupted iterations
booking_stress   [  33% ] 500 VUs  0m20.0s/1m0s

running (0m21.0s), 500/500 VUs, 1031674 complete and 0 interrupted iterations
booking_stress   [  35% ] 500 VUs  0m21.0s/1m0s

running (0m22.0s), 500/500 VUs, 1078955 complete and 0 interrupted iterations
booking_stress   [  37% ] 500 VUs  0m22.0s/1m0s

running (0m23.0s), 500/500 VUs, 1125062 complete and 0 interrupted iterations
booking_stress   [  38% ] 500 VUs  0m23.0s/1m0s

running (0m24.0s), 500/500 VUs, 1172418 complete and 0 interrupted iterations
booking_stress   [  40% ] 500 VUs  0m24.0s/1m0s

running (0m25.0s), 500/500 VUs, 1220325 complete and 0 interrupted iterations
booking_stress   [  42% ] 500 VUs  0m25.0s/1m0s

running (0m26.0s), 500/500 VUs, 1268593 complete and 0 interrupted iterations
booking_stress   [  43% ] 500 VUs  0m26.0s/1m0s

running (0m27.0s), 500/500 VUs, 1315327 complete and 0 interrupted iterations
booking_stress   [  45% ] 500 VUs  0m27.0s/1m0s

running (0m28.0s), 500/500 VUs, 1364117 complete and 0 interrupted iterations
booking_stress   [  47% ] 500 VUs  0m28.0s/1m0s

running (0m29.0s), 500/500 VUs, 1413019 complete and 0 interrupted iterations
booking_stress   [  48% ] 500 VUs  0m29.0s/1m0s

running (0m30.0s), 500/500 VUs, 1461850 complete and 0 interrupted iterations
booking_stress   [  50% ] 500 VUs  0m30.0s/1m0s

running (0m31.0s), 500/500 VUs, 1511293 complete and 0 interrupted iterations
booking_stress   [  52% ] 500 VUs  0m31.0s/1m0s

running (0m32.0s), 500/500 VUs, 1553081 complete and 0 interrupted iterations
booking_stress   [  53% ] 500 VUs  0m32.0s/1m0s

running (0m33.0s), 500/500 VUs, 1601123 complete and 0 interrupted iterations
booking_stress   [  55% ] 500 VUs  0m33.0s/1m0s

running (0m34.0s), 500/500 VUs, 1651926 complete and 0 interrupted iterations
booking_stress   [  57% ] 500 VUs  0m34.0s/1m0s

running (0m35.0s), 500/500 VUs, 1699628 complete and 0 interrupted iterations
booking_stress   [  58% ] 500 VUs  0m35.0s/1m0s

running (0m36.0s), 500/500 VUs, 1749890 complete and 0 interrupted iterations
booking_stress   [  60% ] 500 VUs  0m36.0s/1m0s

running (0m37.0s), 500/500 VUs, 1798877 complete and 0 interrupted iterations
booking_stress   [  62% ] 500 VUs  0m37.0s/1m0s

running (0m38.0s), 500/500 VUs, 1848678 complete and 0 interrupted iterations
booking_stress   [  63% ] 500 VUs  0m38.0s/1m0s

running (0m39.0s), 500/500 VUs, 1896374 complete and 0 interrupted iterations
booking_stress   [  65% ] 500 VUs  0m39.0s/1m0s

running (0m40.0s), 500/500 VUs, 1943377 complete and 0 interrupted iterations
booking_stress   [  67% ] 500 VUs  0m40.0s/1m0s

running (0m41.0s), 500/500 VUs, 1991617 complete and 0 interrupted iterations
booking_stress   [  68% ] 500 VUs  0m41.0s/1m0s

running (0m42.0s), 500/500 VUs, 2041033 complete and 0 interrupted iterations
booking_stress   [  70% ] 500 VUs  0m42.0s/1m0s

running (0m43.0s), 500/500 VUs, 2089655 complete and 0 interrupted iterations
booking_stress   [  72% ] 500 VUs  0m43.0s/1m0s

running (0m44.0s), 500/500 VUs, 2139324 complete and 0 interrupted iterations
booking_stress   [  73% ] 500 VUs  0m44.0s/1m0s

running (0m45.0s), 500/500 VUs, 2187012 complete and 0 interrupted iterations
booking_stress   [  75% ] 500 VUs  0m45.0s/1m0s

running (0m46.0s), 500/500 VUs, 2236317 complete and 0 interrupted iterations
booking_stress   [  77% ] 500 VUs  0m46.0s/1m0s

running (0m47.0s), 500/500 VUs, 2285021 complete and 0 interrupted iterations
booking_stress   [  78% ] 500 VUs  0m47.0s/1m0s

running (0m48.0s), 500/500 VUs, 2329227 complete and 0 interrupted iterations
booking_stress   [  80% ] 500 VUs  0m48.0s/1m0s

running (0m49.0s), 500/500 VUs, 2377615 complete and 0 interrupted iterations
booking_stress   [  82% ] 500 VUs  0m49.0s/1m0s

running (0m50.0s), 500/500 VUs, 2428608 complete and 0 interrupted iterations
booking_stress   [  83% ] 500 VUs  0m50.0s/1m0s

running (0m51.0s), 500/500 VUs, 2477831 complete and 0 interrupted iterations
booking_stress   [  85% ] 500 VUs  0m51.0s/1m0s

running (0m52.0s), 500/500 VUs, 2526304 complete and 0 interrupted iterations
booking_stress   [  87% ] 500 VUs  0m52.0s/1m0s

running (0m53.0s), 500/500 VUs, 2576192 complete and 0 interrupted iterations
booking_stress   [  88% ] 500 VUs  0m53.0s/1m0s

running (0m54.0s), 500/500 VUs, 2626559 complete and 0 interrupted iterations
booking_stress   [  90% ] 500 VUs  0m54.0s/1m0s

running (0m55.0s), 500/500 VUs, 2675417 complete and 0 interrupted iterations
booking_stress   [  92% ] 500 VUs  0m55.0s/1m0s

running (0m56.0s), 500/500 VUs, 2724441 complete and 0 interrupted iterations
booking_stress   [  93% ] 500 VUs  0m56.0s/1m0s

running (0m57.0s), 500/500 VUs, 2772758 complete and 0 interrupted iterations
booking_stress   [  95% ] 500 VUs  0m57.0s/1m0s

running (0m58.0s), 500/500 VUs, 2821861 complete and 0 interrupted iterations
booking_stress   [  97% ] 500 VUs  0m58.0s/1m0s

running (0m59.0s), 500/500 VUs, 2871447 complete and 0 interrupted iterations
booking_stress   [  98% ] 500 VUs  0m59.0s/1m0s

running (1m00.0s), 500/500 VUs, 2921707 complete and 0 interrupted iterations
booking_stress   [ 100% ] 500 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=15.09ms


  █ TOTAL RESULTS 

    checks_total.......: 5847311 97436.053862/s
    checks_succeeded...: 58.55%  3423664 out of 5847311
    checks_failed......: 41.44%  2423647 out of 5847311

    ✓ setup event created
    ✓ status is 202 or 409
    ✗ booking accepted
      ↳  17% — ✓ 500008 / ✗ 2423647

    CUSTOM
    booking_duration...............: avg=7.6ms   min=0s      med=6ms    max=73ms    p(90)=14ms    p(95)=18ms   
    business_errors................: 0.00%   0 out of 2923655

    HTTP
    http_req_duration..............: avg=5.63ms  min=45.5µs  med=4.26ms max=72.24ms p(90)=11.52ms p(95)=15.09ms
      { expected_response:true }...: avg=4.27ms  min=45.5µs  med=3.11ms max=49.35ms p(90)=8.54ms  p(95)=11.91ms
    http_req_failed................: 82.89%  2423647 out of 2923656
    http_reqs......................: 2923656 48718.035263/s

    EXECUTION
    iteration_duration.............: avg=10.04ms min=78.87µs med=8.41ms max=82.46ms p(90)=19.17ms p(95)=23.5ms 
    iterations.....................: 2923655 48718.018599/s
    vus............................: 500     min=500                max=500
    vus_max........................: 500     min=500                max=500

    NETWORK
    data_received..................: 644 MB  11 MB/s
    data_sent......................: 614 MB  10 MB/s



running (1m00.0s), 000/500 VUs, 2923655 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m0s